aa
abadi
abbas
abc
abdallah
abdel
abductors
abide
ability
able
abound
abroad
absent
absolute
abstain
abstains
abstention
absurd
abu
abuqamar
abuse
abused
abuses
abusive
academic
academics
academy
accelerated
accept
accepted
accepting
accepts
access
accordance
according
accountability
accounts
accusations
accuse
accused
accuses
accusing
achieve
achieved
achieving
acknowledge
acre
acres
across
act
action
actions
activated
activist
activists
activity
acts
actually
acute
add
adding
addition
additional
address
addressed
addresses
adds
aden
adequate
adha
administration
administrations
administrative
administrators
admit
admitted
adnan
adopt
adopted
advance
advances
advice
adviser
advocacy
advocates
advocating
adwan
aerial
affairs
affect
affecting
afford
afghanistan
afraid
africa
african
africas
aftermath
age
aged
agencies
agency
aggressive
ago
agree
agreed
agreement
agrees
aharon
ahead
ahel
ahly
ai
aid
aida
aided
aimed
aims
aipac
air
airborne
aircraft
airdrop
aired
airport
airports
airspace
aj
ajopinion
al
alaas
albanese
aleppo
alert
alerted
alex
algeria
algerian
ali
aligned
alishba
alive
allah
allegation
allegations
alleged
alleges
allergic
alley
alleyesonrafah
allied
allies
allow
allowed
allows
ally
almost
aloe
alone
along
alongside
alonyal
already
also
alternatives
although
ambassador
ambassadors
ambiguous
ambulance
american
americans
amid
ammunition
amna
amnesty
among
amos
amount
amounted
amounts
amr
amsterdam
analysis
analyst
analysts
anc
ancient
andrew
andromeda
anecdote
angeles
anger
angered
angling
ankara
annihilation
anniversary
announce
announced
announcement
announces
annual
another
answer
answered
antagonising
anthony
anti
anticipates
anticipating
antigovernment
antitank
antiwar
antonio
antony
anwar
anxious
anyone
anything
anywhere
ap
apocalyptic
app
apparent
apparently
appeal
appealing
appear
appearing
appears
applause
application
applied
applies
apply
appointed
appoints
approach
approaches
appropriate
approved
approves
april
aqsa
arab
arabia
arabic
arabs
arbitrary
area
areas
arent
argue
argued
argues
arm
armed
arming
arms
army
armys
arose
around
arrest
arrested
arresting
arrests
arrive
arrived
arrives
arriving
arsenal
artificial
artillery
artists
asadullah
asia
asked
asking
asks
asma
assassinated
assassination
assault
assaulted
assaults
assembly
assessed
assessment
assistance
assisting
assists
associated
association
assurances
athens
atrocities
attack
attacked
attacking
attacks
attempt
attempted
attempts
attend
attended
attention
attentively
attitudes
attracts
audacious
austin
australia
australian
australias
authorises
authoritarian
authorities
authority
authoritys
authors
average
avert
averting
aviv
avoid
avoids
awaited
awaiting
awards
aware
away
axis
ayatollah
ayman
az
baalbek
baawi
babies
baby
back
backdrop
backed
backers
backing
backs
backward
bad
badges
badly
bags
baked
balah
balance
balancing
ballads
ballot
ban
bani
bank
banks
banned
banners
bans
baraa
barakat
barbados
barely
barghouti
barrage
barred
barrier
barth
base
based
bases
basic
basseres
battalion
battery
battle
battled
battleground
battlegrounds
batya
baz
bears
beat
beaten
beating
beatings
beautiful
beauty
became
become
becomes
becoming
bed
began
begged
begin
beginning
begins
begun
behind
beirut
beit
belgian
belgium
belgrade
believe
believed
believing
belize
belongings
bench
beneath
benjamin
benny
bereavement
berlin
berlins
besieged
besieges
best
bethlehem
bewildered
beyond
bezalel
bias
bid
biden
bidens
big
bigger
biggest
bilateral
bill
billie
billions
bills
binding
bipartisan
birth
birthed
bit
black
blames
blaming
blank
blast
blasts
bleeding
blindsided
blinken
blinks
block
blockade
blockaded
blocked
blocking
blockout
blocks
bloodbath
bloodied
bloody
blow
bn
boats
bodies
body
bogota
boiling
bomb
bombarded
bombarding
bombardment
bombed
bombing
bombings
bombs
booed
boos
border
borders
born
bosnian
bostons
bound
boundary
bowman
boy
boycott
boycotting
boycotts
boys
brace
brands
brave
bravery
breached
bread
break
breakdown
breaking
breaks
bridge
bridges
brief
briefly
brigades
bring
bringing
brings
brink
britains
british
britons
broadcast
broadcaster
broadcasters
broadcasting
broke
broken
broker
brokered
brooklyn
brother
brought
brown
brussels
brutal
budget
buffer
build
building
buildings
builds
built
bulldoze
bulldozed
bulldozer
bureau
bureaucracy
bureij
burial
burials
buried
burlington
burned
burning
bursh
bury
busiest
businesses
busy
buy
buys
cabinet
cabinets
cable
cages
cairo
calamity
calculates
calculus
calendar
calibre
california
call
called
calling
calls
calm
cambridge
came
camera
cameron
camp
campaign
campaigners
campaigning
camps
campus
campuses
canada
canadas
canadian
cancel
cancelled
cancels
cancer
candidate
candidates
capabilities
capable
capacity
cape
capital
captive
captives
captured
captures
car
care
career
carefully
cargo
carnage
carnival
carried
carrier
carries
carry
carrying
cartoned
case
cases
cash
cast
casualties
catastrophic
catholic
cattle
caught
cause
caused
causing
ccny
cease
ceasefire
cecilia
celebrate
celebrates
celebrating
celebrations
celebrities
center
central
centre
centred
centres
centrist
ceremonies
ceremony
certain
cessation
challenge
challenged
challenges
challenging
champions
change
changed
changes
channel
chant
chanted
chanting
chants
chaplain
charges
charismatic
charity
charitys
charlottesville
charm
charred
chasm
chatter
checking
checks
cheers
cheese
chef
chemical
cheque
chicago
chief
child
children
childrens
china
chinas
choked
choose
chord
chose
chris
christian
christians
cia
circulated
circumstances
cited
cites
cities
citing
citizen
citizens
city
citys
civil
civilian
civilians
claim
claimed
claiming
claims
clambering
clash
clashes
classes
cleansing
clear
cleared
clearly
clears
climate
climbing
clinic
clinical
clip
clock
close
closed
closer
closes
closure
clout
club
clutch
co
coal
coalition
coalitions
coast
coastal
coexistence
coi
coined
cold
collapse
collapsed
collapsing
colleagues
collective
college
colombia
colombias
colonial
colonising
columbia
columbias
combat
come
comedian
comes
comforting
coming
command
commander
commemorates
commencement
comment
comments
commercial
commission
commitment
committed
committee
committing
communications
communities
community
companies
companion
compared
comparison
complaints
complete
completely
complex
complicit
complicity
component
components
compound
comprised
comprising
compromise
concern
concerned
concerns
concluded
concludes
concrete
condemn
condemnation
condemned
condemning
condemns
condition
conditions
conduct
conducted
conference
confident
confidential
confirm
confirmation
confirmed
conflating
conflict
conflicting
conflicts
confrontations
confronted
confronting
confusion
congress
congressional
congressman
congresss
conquering
conscience
conscription
consensus
consequences
conservative
considered
considering
considers
consistent
consistently
constantly
constituency
consulate
contacts
container
containing
contending
contentious
contest
context
continue
continued
continues
continuing
contract
contractors
contradicts
control
controls
convention
conventions
convoy
convoys
convulsed
cooks
coordinated
coordinates
coordinating
coordination
coordinator
cop
cope
cops
coral
core
corps
corrected
correctness
correspondent
corridor
cosh
cost
could
couldnt
council
councils
counter
counterattack
counterpart
countless
countries
country
countrys
couple
coupled
courage
court
courtrooms
courts
courtyard
cousin
cover
coverage
covered
crack
crackdown
cracked
create
created
creating
creation
creator
credible
crew
crews
cries
crime
crimes
criminal
crippled
crises
crisis
critic
critical
criticised
criticises
criticism
critics
cross
crossed
crosses
crossfire
crossing
crossings
crowd
crowded
crowds
crucial
crutch
cry
culture
cuny
current
currently
custody
cut
cutoff
cuts
cutting
cyberspace
cycles
cyprus
cypruss
cyril
da
dad
dahdouh
daily
damage
damaged
damages
damascus
dampened
dana
dancing
danger
dangerous
dangers
daniel
daqqa
dark
darkness
dartmouth
darwish
darwishs
data
date
daughter
david
day
days
dc
dcs
de
dead
deadliest
deadline
deadlocked
deadly
deal
deals
death
deaths
debate
debated
debris
decade
decades
december
decided
deciding
decimated
decimation
decision
decisions
decisive
declarations
declare
declared
declaring
decline
declined
decry
deem
deemed
deepen
deepens
deeper
deepest
deeply
defeat
defeating
defence
defences
defend
defended
defending
defends
defense
defiant
defied
defies
defuse
defusing
deir
delay
delays
delegates
delegation
delegations
deliberate
deliberately
deliver
delivered
deliveries
delivering
delivers
delivery
delusions
demand
demanding
demands
democrat
democratic
democrats
demolishing
demonising
demonstrate
demonstrated
demonstrating
demonstration
demonstrations
demonstrator
demonstrators
denied
denounce
denounced
denouncing
densely
dentistry
denying
depart
department
departments
departures
dependent
deployed
deportation
depriving
deputy
derail
describe
described
describes
describing
designated
designed
desk
desperate
desperately
desperation
despite
destroy
destroyed
destroying
destruction
destructive
detailed
details
detained
detainee
detainees
detaining
detention
detentions
deteriorate
determination
determined
detonated
deutsch
devastated
devastates
devastating
devastation
developed
development
developments
devices
devoted
diagnosed
diaspora
dictatorial
didnt
die
died
dies
difference
different
differentiate
dig
digital
dilemma
diplomat
diplomatic
dire
direct
director
disabled
disagree
disappoint
disapproval
disaster
disastrous
disbanded
disbursed
disbursement
discourse
discover
discovered
discovery
discrimination
discuss
discussed
discusses
discussing
disease
disengagement
dish
disillusioned
dismantle
dismantled
dispersal
disperse
dispersed
displaced
displacement
displaces
display
displeasure
disproportionate
disrupted
dissect
dissolved
dissolves
distraction
distracts
distribution
diverse
divert
diverting
divest
divestment
divide
divided
dividing
dock
doctor
doctors
document
documents
doesnt
doha
dohas
dollars
dome
domestic
donald
donate
done
dont
doomed
dotted
doubled
doubt
doused
downed
downplays
dozens
dr
draft
drafted
drag
dragged
dragging
drainage
dramatic
draw
drawing
drawn
draws
dream
dreams
drew
drive
driven
drives
driving
drone
drones
dropped
drown
drowned
drums
due
duration
dutch
duty
dwindling
dying
détente
earlier
early
earth
east
easter
eastern
eat
eating
echoes
eco
economic
ecosystem
editor
education
effect
effective
effectively
efficient
effort
efforts
efrat
egypt
egyptian
egypts
eid
eide
eight
eighth
eighty
eilish
el
elderly
eldest
election
elections
electricity
elements
elias
eligible
elijah
eliminate
eliminating
elites
ellen
else
elsewhere
embargo
embattled
emerge
emergency
emerging
emerson
emory
employ
employee
employees
employer
enable
enablers
enact
encamp
encampment
encampments
enclave
enclaves
encroached
end
endangerment
ended
endemic
ending
endless
endorsed
endorses
enemys
energy
engage
england
english
ensure
enter
entered
entering
enters
enthusiastic
entire
entrepreneur
entry
enveloping
environmental
envoy
envoys
equality
equate
equipment
equivalence
erdan
erdogan
erez
eroding
errors
erupted
es
escalate
escalated
escalates
escalating
escalation
escape
especially
espen
essence
essential
established
establishes
establishing
establishment
estate
estimated
estimates
ethnic
etna
eu
europe
european
eurovision
evacuate
evacuation
evaluating
eve
even
evening
event
events
eventual
ever
every
everyone
everything
everywhere
evidence
evident
evokes
ex
exactly
exceptionalising
excessive
exchange
exclusive
excuses
executed
executioner
executions
exemption
exercise
exert
exist
expand
expanded
expanding
expands
expansion
expectations
expected
expects
expelled
expense
experience
experiment
expert
experts
explaining
explains
explanation
explicit
explicitly
exploiting
explosions
explosive
exponential
exports
exposed
express
expressed
expresses
expressing
expression
expulsion
extend
extends
extent
extermination
extra
extravaganza
extreme
eye
eyeing
eyes
f
face
faced
faces
facilitate
facilitation
facilities
facility
facing
factions
faculty
fail
failed
failure
failures
faith
falafel
fall
fallout
falls
false
familiar
families
family
famine
famous
far
farm
farrah
fast
fasting
fatal
fatalities
father
fatmeh
fattah
fault
favour
favourably
favoured
favourite
fear
feared
fears
features
featuring
february
feed
feeding
feel
feelings
feels
feinstein
fell
fellow
felt
female
festival
fewer
field
fields
fierce
fiery
fig
fight
fighter
fighters
fighting
filed
fill
filled
film
filmed
filming
filmmaker
final
finally
finance
find
finds
fingernails
finish
finneas
fire
fired
fires
fireworks
firing
firmer
firms
first
fist
fitch
fitr
five
fix
flag
flagged
flags
flattened
fled
flee
fleeing
flies
flights
floating
flooding
floor
florida
flour
flow
fluent
flying
fm
focus
focused
folk
follow
following
follows
food
fool
foot
footage
football
footballer
footsteps
force
forced
forces
forcibly
forcing
foreign
forensic
forged
forget
forgotten
fork
form
formal
formalise
formally
former
forth
forty
forum
forward
found
foundation
founder
founding
four
fourth
france
francesca
franchise
franchisee
francis
frantic
fraught
free
freed
freedom
freeze
french
freshly
friction
friday
friends
friendship
front
fuel
fuels
full
functional
fund
funded
funding
funds
funeral
furious
future
g
gain
gala
gallant
game
gantz
gantzs
gap
gas
gate
gathered
gathering
gave
gaza
gazas
gears
gender
general
generals
generated
generation
generational
generosity
genocidaires
genocidal
genocide
george
georgetown
georgias
german
germany
germanys
get
gets
getting
ghaben
ghassan
ghazi
ghent
ghoul
ghouls
gilad
gillan
gillian
girl
girls
give
given
gives
giving
global
globally
globe
go
goal
goals
goes
going
goldberg
golden
gone
good
goodbye
goods
govern
governed
governing
government
governments
governorate
govt
graduate
graduation
granberg
grandchildren
grandpa
grandparents
grant
graphics
gratitude
grave
graves
graveyard
great
greater
greece
greeces
greek
greenberg
greenlighted
greenpeace
greeting
greta
grief
grocer
gross
ground
grounds
group
groups
grove
grow
growing
grown
grows
growth
guantanamo
guard
guards
guest
guide
guides
guillotine
guilty
gulf
gunfire
guns
gustavo
guterres
gw
habbariyeh
hagari
haifa
haitham
hajj
half
halfway
haliva
hall
halls
halt
halted
halts
hamas
hamass
hamdan
hamilton
hammad
hammer
hampered
hampering
hanan
hand
handed
handling
hands
hanging
hani
haniyeh
haniyehs
hanna
hanoi
hanois
hanoon
happen
happened
happening
harass
harassment
hardliners
hardship
harm
harming
harms
haroon
harris
harriss
harsh
harsher
harvard
hashemite
hasnt
hassan
hate
hateful
hauled
haunt
havent
hawwash
hayya
head
headed
heading
healing
health
healthcare
hear
heard
hearing
heart
heartbroken
heartening
heaviest
heavily
heavy
heba
hebrew
hebron
heckle
heckled
heckler
heckling
hectares
heeded
hefets
heifers
heightened
heinous
held
helicopter
helicopters
help
helped
helping
hemmed
heres
heritage
hersh
hes
hezbollah
hezbollahs
hidden
hide
high
highest
highlighted
highway
highways
hill
hills
hind
hinder
historic
historical
historically
history
hit
hits
hitting
hochstein
hodeidahs
hold
holding
holds
holiday
hollen
hollingworth
hollywood
holocaust
holy
homaid
homaids
home
homes
hometown
honest
hood
hope
hoped
hopeful
hopes
hoping
hormuz
horrific
horrified
horror
horrors
hospital
hospitals
hostage
hostages
hostile
hostilities
hour
hours
house
housing
houthi
houthis
however
hrw
https
hub
huge
human
humanitarian
humanity
humiliating
humiliation
hundreds
hung
hunger
hungry
hurt
husam
hypocrisy
hypocrite
ian
ibrahimi
icc
iccs
icj
identifiable
identifying
iftar
igniting
ignore
ignored
ignoring
ii
ilerymkqc
ill
illegal
illinois
illustrated
im
image
imagery
images
imaginations
immediate
immediately
immense
immigration
imminent
immovable
immune
impact
impacts
impasse
impending
implemented
implicit
important
imports
impose
imposed
imposes
imposing
impossible
imprisoned
improve
impunity
inability
inception
incident
incitement
include
includes
including
inclusion
increase
increased
increases
increasing
increasingly
incursion
independent
indicate
indicated
indicates
indications
indirect
indiscriminate
indonesia
indonesian
industry
infamous
infant
infest
inflict
inflicted
influence
information
infrastructure
ingram
initial
initiative
injured
injuries
inquiry
insects
insensitive
inserting
inside
insiders
insidious
insightful
insisting
insists
inspired
instead
institute
institution
institutions
instructs
integration
integrity
intelligence
intense
intensification
intensified
intensifies
intensify
intensifying
intent
intentional
intentionally
intercepted
intercepting
interest
intergenerational
interim
interior
internal
international
internationally
interrupted
intervention
interview
intifada
intimidation
invade
invades
invasion
invented
investigates
investigation
investigations
investigative
invisible
invitation
invitees
involved
involvement
iom
iran
iranian
irans
iraq
iraqi
iraqs
ire
ireland
irgc
iris
irish
iron
ironclad
irritants
irvine
isfahan
ishaq
islamic
islams
ismail
isolating
isolation
israel
israeli
israelis
israels
issa
issam
issue
issued
issues
istanbul
italy
items
ive
jaafrawi
jabalia
jahangir
jail
jailed
jala
jamaal
january
jared
javaid
jawdat
jazeera
jazeeras
jean
jeep
jeffrey
jenin
jerry
jerusalem
jerusalems
jet
jets
jew
jewish
jews
jimmy
joe
john
johnson
join
joined
joining
joins
joint
jones
jordan
jordans
jouda
journalist
journalists
journey
joy
jr
judaism
judges
july
june
justice
justifies
justify
kaabna
kabash
kahlenberg
kais
kamal
kamala
kamel
karem
karim
katz
keep
keeps
kelana
kept
key
khalil
kham
khamenei
khan
khoudary
kibbutz
kicked
kid
kidnappers
kids
kill
killed
killers
killing
killings
kills
kimmel
kind
kinds
king
kingdom
kiryat
kitchen
knelt
knesset
know
knowing
knowledge
known
knows
kushner
kuwait
kuwaiti
kwasmi
kyriakos
labelled
labour
labyrinth
lack
lahia
lahiya
laid
lamont
land
landed
landscape
lanes
language
lanka
lankan
lapd
large
largely
larger
largest
larnaca
last
lasting
late
later
latest
latimer
laud
laughing
launch
launched
launches
law
lawmakers
lawn
laws
lawsuits
lawyer
lawyers
lay
laying
lazzarini
lead
leader
leaders
leadership
leading
leads
leans
learn
learned
learner
least
leave
leaves
leaving
lebanese
lebanon
lebanons
lecture
lecturers
led
lee
leeds
lees
left
leg
legal
legally
legislation
legislative
legislators
lennie
less
lessons
let
letter
letting
level
levelled
levels
liars
liberties
lie
life
lifelong
lifted
lifting
light
like
likely
lily
limited
limiting
limits
line
lines
linked
links
liquid
list
listed
listen
listened
little
live
lived
lives
living
lng
local
locals
locations
locked
london
long
longer
longtime
look
looking
lookout
looks
looming
looms
los
lose
loser
loses
losing
loss
losses
lost
lot
lottery
louder
loved
loyalty
lucky
luis
lustick
luther
lying
machinegun
madbouly
made
madrid
maghazi
maha
mahdi
mahmoud
main
mainly
mainstream
maintain
maintained
maintaining
mainz
major
majority
make
makeshift
making
malaysia
malcontents
male
malnourished
malnutrition
malta
mama
man
mandate
manufacturers
manufacturing
many
maple
maqlouba
marc
march
marched
marchers
marching
marginalised
mariam
mariniellos
maritime
mark
market
marking
marks
martin
martyrs
marwan
masirah
masked
mass
massacre
massacring
massive
matter
matters
matthew
mawasi
max
may
maya
mayoral
maysoon
mazen
mcdonalds
mcgill
meal
meals
mean
meaningful
meaningless
means
meant
meanwhile
measure
measures
mechanisms
medan
media
mediation
mediator
mediators
medic
medical
medicine
medics
mediterranean
meet
meeting
meetings
meets
melbourne
member
members
membership
memorial
memories
men
menachem
mention
merchant
message
messages
messina
met
metal
methods
metres
michael
michigan
mid
middle
midst
might
migration
mike
miles
militarised
military
militarys
milk
miller
million
millions
milwaukee
mind
minimise
minimum
minister
ministers
ministry
minute
mischaracterised
missile
missiles
missing
mission
mistake
mistakenly
mistreatment
mitotakis
mm
moath
mob
mobilisation
mocking
modern
mohammad
mohammed
molokhia
mom
moment
momentary
moments
momentum
monday
monitor
month
months
montreal
mood
moral
morehouse
moreno
morning
mortar
mosely
mosque
mosques
mostafa
mostly
mother
mothers
motion
motions
motive
mount
mounting
mourning
move
moved
movement
movements
moves
moving
mps
mq
much
mughayyir
muhtaseb
mujahed
mulligan
multiple
municipal
munitions
murajaat
murder
musara
music
musicians
muslim
muslims
must
mustafa
mustafas
muster
muted
mv
nabahin
nada
naive
naivety
nakba
named
nappies
narrative
narrow
nasrallah
nasser
nathan
nation
national
nationalist
nations
nationss
nationwide
naval
navy
nbc
near
nearby
nearing
nearly
necessary
necessities
need
needed
needs
negative
negotiate
negotiating
negotiation
negotiations
neighbour
neighbourhood
neighbourhoods
neighbouring
neighbours
netanyahu
netanyahus
netherlands
network
networks
netzah
neutral
never
nevertheless
new
newborn
newest
newly
news
newspapers
newsweek
next
ngo
ngos
nicaragua
nicaraguas
night
nightmare
nightmares
nine
nod
non
none
nonpolitical
nonstop
north
northern
northwest
norway
norwegian
notched
nothing
novel
novelist
november
novembers
noy
number
numbers
nur
nuseirat
nypd
object
objective
objects
obligation
obligations
observe
observer
observing
obsessed
obstacle
obstructs
obtained
ocampo
occasion
occupation
occupied
occupying
oconnell
oct
october
odeh
offences
offensive
offer
offering
office
officer
officers
official
officially
officials
often
ohare
oil
old
one
ones
ongoing
online
onslaught
onto
onus
open
opened
opening
operate
operated
operation
operationally
operations
opinion
opponents
oppose
opposed
opposition
oppositions
option
options
ordeal
ordeals
order
ordered
ordering
orders
ordinarily
organisations
organiser
organisers
organization
originally
orly
orthodox
orthopaedics
oscars
ostensibly
ostracising
others
outcome
outcry
outlet
outlets
outlined
outlines
outposts
outrage
outraged
outrageous
outside
overambitious
overcrowded
overflowing
overhead
overlooking
overnight
overseas
overshadow
overshadowed
overwhelmingly
owen
owned
owners
ownership
oxfam
oxford
pa
pacific
package
packages
page
pain
pained
painful
paint
pakistan
pakistani
pale
pales
palestians
palestine
palestines
palestinian
palestinians
pall
panacea
panel
parade
paraded
parallels
paralyse
paramedic
paramedics
paris
pariss
parlay
parliament
parsi
part
participate
participated
participation
particularly
parties
partners
partnerships
parts
party
partys
pass
passage
passed
passes
past
patel
path
pathway
patient
patients
patricks
patrolling
patrols
pattern
patterns
pause
pauses
pave
paves
paving
pay
payment
peace
peaceful
peacemaker
peanut
pedro
peers
penalties
pennsylvania
people
peoples
pepper
percent
percentage
performance
performers
perhaps
peril
period
permanent
permanently
permits
perpetuates
person
personal
personnel
perspectives
pesticide
petro
phase
philadelphi
philippe
phone
phosphorous
phosphorus
photo
photos
phrase
phrases
physically
physicians
physics
pictures
piece
pier
piles
pilgrimage
pin
pink
pins
pivotal
placards
place
placed
places
plague
plan
planck
plane
planes
planned
planning
plans
plants
plastic
plausible
plausibly
played
player
players
playing
plea
pleading
please
pleased
pledge
pledged
pledges
plight
plummeted
plummets
pm
po
podium
poems
poet
poetic
point
points
poland
police
policies
policing
policy
polin
polio
polish
political
politician
politicians
politics
poll
polls
pomegranate
poor
pope
popular
populated
population
populations
port
ports
pose
posed
poses
position
positions
positive
possession
possibility
possible
post
posts
potential
potentially
pound
pounds
power
powerful
powers
pr
practical
praised
prayer
prayers
precise
premature
premieres
preparation
preparations
prepare
prepares
preparing
present
preserving
president
presidential
presidents
press
pressed
presses
pressure
pressured
pressures
presumably
prevail
prevent
preventing
prices
pricing
prides
primary
prime
principal
principally
priority
prison
prisoner
prisoners
prisons
private
privileges
prized
pro
probe
problems
process
produced
products
professor
professors
programme
programmes
progress
progressive
prohibit
projectiles
prominent
promise
promised
promises
promising
promote
prompting
prompts
pronounced
propaganda
property
proportion
proposal
proposals
propose
proposed
prosecute
prosecution
prosecutor
prosecutors
prospective
prospects
protect
protection
protest
protested
protester
protesters
protesting
protests
provide
provided
provides
province
provisions
provocative
provoke
psychic
psychological
psychotherapy
public
publicly
published
pulled
pulley
pulls
pummelled
punched
punches
punish
punishment
punishments
punk
push
pushed
pushes
pushing
put
putra
puts
pyjamas
qaddourah
qafisheh
qassam
qatar
qatari
qatars
qeeq
qualified
quarter
quds
question
questioned
questioning
questions
quickly
quite
quo
rabbi
race
racial
racism
racist
radwan
raels
rafah
rafahs
raged
rages
raging
raid
raided
raiding
raids
raise
raised
raises
raising
raja
raji
rallied
rallies
rally
ramadan
ramallah
ramaphosa
ramming
ramp
rampage
ramy
range
rapporteur
rapporteurs
rare
rating
ratings
rats
ravaged
reach
reached
reaches
reaching
reaction
reacts
read
reading
ready
reagans
real
realised
realising
realities
really
reaper
reappointed
reappoints
reason
reasonable
reasons
reassess
reassessment
rebuilding
rebukes
recall
received
receives
receiving
recent
recep
recognise
recognised
recognises
recognising
recognition
recommending
reconsider
reconstruction
record
recount
recounts
recover
recovered
recovering
red
reefs
reflect
reflected
reflecting
reform
refuge
refugee
refugees
refusal
refused
refusing
refute
regimes
region
regional
regular
rehabilitation
rein
reinforced
reinforcing
reinstalled
reiterates
reiterating
reject
rejected
rejecting
rejection
rejects
related
relating
relations
relationship
relationships
relatively
relatives
release
released
relentless
relevant
reliable
reliant
relied
relief
religion
religious
reliving
reluctance
rely
remain
remainder
remained
remaining
remains
remarks
remember
remembered
remembering
remembrance
reminded
removal
remove
removed
renamed
rendered
rendering
renewed
renews
reopen
reopening
repatriated
repeated
repeatedly
repeats
repercussions
report
reported
reportedly
reporter
reporters
reporting
reports
represent
representative
representatives
represents
republican
republicans
request
requested
requests
require
required
requirement
rescue
rescued
rescuers
research
reshaping
resident
residential
residents
resign
resignation
resigned
resigns
resilience
resist
resistance
resolution
resolutions
resort
respond
responded
responding
responds
response
responses
responsibility
rest
restart
restaurants
resting
restore
restraint
restrict
restrictions
restricts
result
resulted
resulting
resume
resumes
resuming
retaliate
retaliation
retaliatory
retrieve
retrieved
return
returned
returns
reuters
reveal
revealed
revenge
revenues
review
reviewing
revisiting
revive
revived
revoked
revokes
revolutionary
rhetoric
ridiculous
rift
right
rights
rios
riot
ripped
ripple
rise
risen
rises
rising
risk
risked
risking
risks
rival
river
road
roads
roadside
rock
rocket
rockets
role
rolled
rolls
ronald
rooftops
rotting
roughly
rouh
round
roundabout
rounds
route
rubbish
rubble
rubymar
ruffalo
ruined
ruins
rule
rules
ruling
run
running
runs
rushed
russia
russian
rwanda
sabreen
sachs
sacrifice
sad
sadaqa
saddened
safe
safer
safety
said
saied
saif
sailors
sake
saleem
salem
sales
salvoes
sanaa
sanad
sanchez
sanction
sanctioned
sanctions
sanctuary
sand
sanitation
saree
sargon
satellite
saturday
saturdays
saudi
save
saved
saving
saw
say
saying
says
scale
scars
scathing
scattered
scenes
scheduled
scholars
school
schooling
schools
sciences
scientist
scour
scream
scrutiny
scuffles
sea
seafarers
search
searched
searches
searching
sebastia
secluded
second
seconds
secretary
secretly
secure
securing
security
see
seeing
seek
seekers
seeking
seeks
seemed
seeming
seems
seen
sees
seinfeld
seized
seizes
seizure
self
sell
semitism
senator
send
sending
senior
sensationalist
separate
separately
separating
september
serb
serbia
series
serious
seriously
sersek
serve
served
service
services
session
set
sets
setting
settled
settlement
settlements
settler
settlers
seven
seventh
sever
several
severe
severely
sexual
shaaban
shadid
shadow
shaer
shake
shameful
shaming
shamir
shams
shape
shaping
share
shared
shares
sharp
shati
shedding
shelled
shelling
shells
shelter
sheltering
shield
shielded
shielding
shields
shifa
shift
shifted
shifting
ship
shipment
shipments
shipping
ships
shmona
shocking
shoot
shoots
shop
short
shortage
shortages
shot
shoulder
shoulders
shouted
shouting
show
showdown
showed
showing
shown
shows
shrapnel
shrunk
shut
shutdown
shutdowns
shutting
sicily
sick
sickness
side
sides
siding
siege
sieges
sight
sign
signature
signed
significant
signs
siham
silence
similar
simultaneously
since
singing
sink
sinking
sinwar
sirens
sisi
sister
sit
site
sites
sits
sittah
sitting
situation
six
sixth
skills
skyrocket
skyrocketing
slam
slammed
slams
sleep
slick
slogans
slovenia
slovenias
slow
slowly
small
smears
smells
smile
smoking
smotrich
smotrichs
snipers
soar
social
societal
society
soldier
soldiers
solidarity
solution
sombre
someone
something
son
song
sons
soon
soraya
sort
sorties
sought
sound
sounds
sourani
sources
south
southeast
southern
southernmost
sovereignty
spaces
spain
spains
spanish
sparks
spawned
speak
speaker
speakers
speaking
speaks
spearheaded
special
specialty
spectators
speech
spell
spend
spending
spent
spirit
spoke
spokesman
spokesmans
spokesperson
spokeswoman
sponsored
sport
spot
spray
spraying
spread
springs
spurred
spurring
spy
spying
squad
square
squeezes
srebrenica
sri
st
stablise
stablised
staff
staffer
staffs
stage
staged
stages
staging
stalked
stall
stalled
stalling
stance
stand
standing
standoff
star
starbucks
stark
starmer
stars
start
started
starting
starvation
starve
starved
starving
state
stated
statehood
statements
states
statess
station
stationing
status
staunchest
stave
stay
steadfast
steadily
steam
steers
step
steps
stern
stick
sticking
stifles
still
stood
stop
stopped
stopping
stops
stories
storm
stormed
story
strain
strains
strait
stranger
strap
strapped
strategies
strategy
streets
stressed
stresses
stressing
strictest
strike
strikes
striking
string
strip
strips
strong
strongest
strongly
struck
struggle
struggling
stuck
student
students
studies
studying
stunning
style
subject
subjected
submitted
substantial
suburban
success
successful
successfully
successive
sudanis
suffered
suffering
suffers
suggest
suheila
suit
sukkar
sultan
sumatra
summer
summit
sun
sunday
sunk
supplier
supplies
supply
supplying
support
supporters
supporting
supportive
supports
supposed
supreme
surges
surpluses
surprise
surrey
surround
surrounding
surroundings
surveillance
survey
survival
survive
survived
surviving
survivors
suspected
suspend
suspended
suspending
suspends
suspension
suspicion
sustainable
sustained
swathes
sway
sweden
sweeping
swim
swing
symbol
symbolic
symbolism
sympathisers
syria
syrian
syrias
system
systematically
systemic
systems
table
tack
tackle
tactic
tactical
tactics
taiwan
tajamaa
take
takeaways
taken
takeover
takes
taking
tal
talk
talked
talking
talks
tank
tanker
tanks
taps
target
targeted
targeting
targets
targetted
tasered
tasers
task
tasked
tasneem
tat
tayyip
teach
team
teams
tear
tears
technologies
technology
tedros
teenager
tehran
tehrans
tel
telegraphed
televised
television
tell
telling
tells
temple
temporarily
temporary
tens
tense
tensions
tent
tents
term
terminally
terminated
terrain
terrified
terrifying
territories
territory
territorys
terror
terrorist
tess
test
tests
texan
texas
text
th
thaer
thanks
thats
theatrics
theres
theyd
theyre
theyve
thien
thing
things
think
third
thirds
thirst
thirteen
thorn
though
thoughts
thousands
threat
threaten
threatened
threatening
threatens
threats
three
thronged
throughout
throwing
thrown
throws
thunberg
thursday
thus
thwarted
thwarts
tie
tied
ties
tight
tightrope
time
timeline
times
tiny
tit
today
todays
told
toll
tone
tonnes
took
tool
top
tor
tore
torn
torture
total
tough
tour
tournament
tournaments
tout
towards
tower
towered
town
towns
tracking
trade
traditionally
tragedy
trail
transfer
transfers
transformed
transparent
trap
trapped
trapping
trauma
travel
travelled
treatment
trees
trend
trespassing
trial
tribal
tribunal
tried
tries
triestino
trigger
triggered
triggering
triggers
trilateral
trita
troopers
troops
truce
trucks
true
trump
trust
trusty
try
trying
tucked
tuesday
tuesdays
tulkarem
tunisias
tunnel
turk
turkey
turkeys
turkish
turmoil
turn
turned
tusk
tv
twice
twist
two
types
ucla
ugly
uk
ukraine
uks
ulterior
ultimate
ultimatum
ultra
ultranationalist
ululating
un
unable
unacceptable
unanswered
unarmed
unbearable
unbelievable
uncensored
uncommitted
unconditional
uncover
uncovered
uncovering
undated
underestimate
undergraduate
underpin
understand
understandable
unesco
unfettered
unflinching
unfolding
unfolds
unfreeze
unga
ungar
unhindered
unicef
unifil
unimaginable
uninstructed
union
unions
unit
unite
united
units
unity
universities
university
universitys
unknown
unlawful
unleashed
unlikely
unlivable
unmarked
unprecedented
unpublished
unravelled
unrelenting
unrest
unrwa
unrwas
uns
unsc
unsolvable
unspeakable
unstoppable
untrue
unusual
unveils
unviable
unwavering
upbringing
update
updates
upfront
upgraded
upgrades
upstart
urban
urge
urged
urgency
urgent
urges
urging
us
usc
use
used
users
uses
using
uss
usual
ut
uttered
uva
vaccines
vague
vagueness
valuable
values
van
various
vary
vashem
vast
vatican
vedant
vehicle
vehicles
venue
verification
vermont
version
vessel
vessels
veto
vetoed
vetoes
via
vice
vicious
victims
victory
video
videos
vietnam
vietnamese
vietnams
view
viewers
views
vigilante
vigilantes
village
villagers
villages
violate
violated
violating
violation
violations
violence
violent
violently
viral
virginia
virtually
visa
visas
vision
visit
vital
vocally
voice
voices
volcano
volker
volume
volunteer
vote
voted
voters
votes
vow
vowed
vows
wael
wage
wages
waging
waiting
wake
wales
walid
walk
walked
walking
want
wants
war
warfare
warming
warn
warned
warning
warnings
warns
warplanes
warrant
warrants
wars
warship
warships
wartime
wary
washington
washingtons
wasnt
watch
watchdogs
watching
water
waterfront
waters
watershed
wave
wavered
waving
way
ways
wck
weakness
wealthy
weapon
weaponised
weaponry
weapons
wear
weather
weaved
wednesday
wee
week
weekend
weekly
weeks
weighing
welcome
welcomed
welcomes
well
wennesland
went
werent
west
western
wfp
wfps
whats
wheelchair
whether
whim
white
whod
whole
whose
wide
widely
widen
widening
wider
widespread
wield
wikileaks
wildfire
willing
willingness
win
windows
winds
wing
wisconsin
wisconsins
wish
withdraw
withdrawal
withdrawing
withdrawn
withdraws
withdrew
withhold
withholding
within
without
witnessed
witnesses
witnessing
woes
woman
womb
women
womens
wonder
wont
word
words
wore
work
worked
worker
workers
working
works
world
worlds
worms
worried
worse
worsening
worsens
worship
worshippers
worth
would
wounded
wounding
wounds
wrapped
wrath
wreath
writer
writing
yad
yahya
year
yearlong
yearn
years
yehuda
yemen
yemeni
yemens
yet
yoav
york
yorks
young
youngest
younis
youniss
youssef
youth
youtu
yusaf
yusuf
zakaria
zawayda
zecharia
zin
zionism
zionist
zionists
zip
zone
zones
